CSI API ETABS v1
cGenDispl.SetPoint Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetPoint(
	string Name,
	string PointName,
	ref double[] SF
)
Function SetPoint (
	Name As String,
	PointName As String,
	ByRef SF As Double()
) As Integer
Dim instance As cGenDispl
Dim Name As String
Dim PointName As String
Dim SF As Double()
Dim returnValue As Integer
returnValue = instance.SetPoint(Name,
	PointName, SF)
int SetPoint(
	String^ Name,
	String^ PointName,
	array<double>^% SF
)
abstract SetPoint :
        Name : string *
        PointName : string *
        SF : float[] byref -> int
Parameters
Name
Type: System.String
PointName
Type: System.String
SF
Type: System.Double[]
Return Value
Type: Int32
See Also
Reference
cGenDispl Interface
ETABSv1 Namespace